src/InformationRegisters/РазрешенныеИнформационныеБазы/РазрешенныеИнформационныеБазы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РазрешенныеИнформационныеБазы</name>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИнформационнаяБаза</name>
    <type>
      <types>CatalogRef.ИнформационныеБазыКластера</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/CommonModules/ПраваУправленияСеансами/Module.bsl
#Область ПрограммныйИнтерфейс

// Возвращает признак права менять блокировку сеансов и регламентных заданий.
//
// Возвращаемое значение:
//  Булево
//
Функция МожноУправлятьБлокировкой() Экспорт
	Возврат Пользователи.ЭтоПолноправныйПользователь();
КонецФункции

// Возвращает признак права читать состояния и завершать сеансы.
//
// Возвращаемое значение:
//  Булево
//
Функция МожноЗавершатьСеансы() Экспорт
	Возврат Пользователи.ЭтоПолноправныйПользователь()
		Или Пользователи.РолиДоступны("ОператорТехподдержки,ОграниченныйОператорТехподдержки");
КонецФункции

// Возвращает признак доступа ко всем информационным базам без персонального списка.
//
// Возвращаемое значение:
//  Булево
//
Функция ИнформационныеБазыДоступныБезОграничения() Экспорт
	Возврат Пользователи.ЭтоПолноправныйПользователь()
		Или Пользователи.РолиДоступны("ОператорТехподдержки");
КонецФункции

// Возвращает признак разрешения работы с указанной информационной базой.
//
// Параметры:
//  ИнформационнаяБаза - СправочникСсылка.ИнформационныеБазыКластера
//
// Возвращаемое значение:
//  Булево
//
Функция РазрешенаИнформационнаяБаза(ИнформационнаяБаза) Экспорт
	Если Не ЗначениеЗаполнено(ИнформационнаяБаза) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Не МожноЗавершатьСеансы() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ИнформационныеБазыДоступныБезОграничения() Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат РазрешенныеИнформационныеБазы().Найти(ИнформационнаяБаза) <> Неопределено;
КонецФункции

// Возвращает информационные базы, разрешенные текущему ограниченному оператору.
// Помеченные на удаление базы в список не входят.
//
// Возвращаемое значение:
//  Массив из СправочникСсылка.ИнформационныеБазыКластера
//
Функция РазрешенныеИнформационныеБазы() Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Попытка
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	РазрешенныеИнформационныеБазы.ИнформационнаяБаза КАК ИнформационнаяБаза
		|ИЗ
		|	РегистрСведений.РазрешенныеИнформационныеБазы КАК РазрешенныеИнформационныеБазы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИнформационныеБазыКластера КАК ИнформационныеБазыКластера
		|		ПО РазрешенныеИнформационныеБазы.ИнформационнаяБаза = ИнформационныеБазыКластера.Ссылка
		|ГДЕ
		|	РазрешенныеИнформационныеБазы.Пользователь = &Пользователь
		|	И НЕ ИнформационныеБазыКластера.ПометкаУдаления";
		Запрос.УстановитьПараметр("Пользователь", Пользователи.ТекущийПользователь());
		Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ИнформационнаяБаза");
	Исключение
		УстановитьПривилегированныйРежим(Ложь);
		ВызватьИсключение;
	КонецПопытки;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;
КонецФункции

// Вызывает исключение, если нет права читать сеансы или завершать их в указанной базе.
//
// Параметры:
//  ИнформационнаяБаза - СправочникСсылка.ИнформационныеБазыКластера
//
Процедура ПроверитьПравоЗавершенияСеансов(ИнформационнаяБаза) Экспорт
	Если РазрешенаИнформационнаяБаза(ИнформационнаяБаза) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписатьОтказВДоступе(ИнформационнаяБаза, НСтр("ru = 'Недостаточно прав для управления сеансами выбранной информационной базы.'",
		ОбщегоНазначения.КодОсновногоЯзыка()));
	ВызватьИсключение НСтр("ru = 'Недостаточно прав для управления сеансами выбранной информационной базы.'");
КонецПроцедуры

// Вызывает исключение, если нет права менять блокировку сеансов и регламентных заданий.
//
Процедура ПроверитьПравоУправленияБлокировкой() Экспорт
	Если МожноУправлятьБлокировкой() Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписатьОтказВДоступе(Неопределено, НСтр("ru = 'Недостаточно прав для изменения блокировки сеансов и регламентных заданий.'",
		ОбщегоНазначения.КодОсновногоЯзыка()));
	ВызватьИсключение НСтр("ru = 'Недостаточно прав для изменения блокировки сеансов и регламентных заданий.'");
КонецПроцедуры

// Пишет в журнал регистрации факт завершения сеансов.
//
// Параметры:
//  ИнформационнаяБаза - СправочникСсылка.ИнформационныеБазыКластера
//  НомераСеансов - Массив из Число
//
Процедура ЗаписатьЗавершениеСеансов(ИнформационнаяБаза, НомераСеансов) Экспорт
	ПредставлениеНомеров = СтрСоединить(НомераСеансовКакСтроки(НомераСеансов), ", ");
	Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Завершение сеансов информационной базы %1. Номера сеансов: %2.'",
			ОбщегоНазначения.КодОсновногоЯзыка()),
		Строка(ИнформационнаяБаза),
		ПредставлениеНомеров);
	
	ЗаписьЖурналаРегистрации(
		НСтр("ru = 'Управление сеансами.Завершение сеансов'", ОбщегоНазначения.КодОсновногоЯзыка()),
		УровеньЖурналаРегистрации.Информация,
		Метаданные.Справочники.ИнформационныеБазыКластера,
		ИнформационнаяБаза,
		Комментарий);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаписатьОтказВДоступе(ИнформационнаяБаза, Комментарий)
	ЗаписьЖурналаРегистрации(
		НСтр("ru = 'Управление сеансами.Отказ в доступе'", ОбщегоНазначения.КодОсновногоЯзыка()),
		УровеньЖурналаРегистрации.Предупреждение,
		Метаданные.Справочники.ИнформационныеБазыКластера,
		ИнформационнаяБаза,
		Комментарий);
КонецПроцедуры

Функция НомераСеансовКакСтроки(НомераСеансов)
	Результат = Новый Массив;
	Для Каждого НомерСеанса Из НомераСеансов Цикл
		Результат.Добавить(Формат(НомерСеанса, "ЧГ="));
	КонецЦикла;
	Возврат Результат;
КонецФункции

#КонецОбласти
